[
  {
    "path": "posts/welcome/",
    "title": "Welcome to Tabula Rasa",
    "description": "The world forgetting by the world forgot. Eternal Sunshine of the Spotless Mind!",
    "author": [
      {
        "name": "Atticus Foo",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-01-20",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-20T18:50:34+08:00",
    "input_file": "welcome.utf8.md"
  },
  {
    "path": "posts/2021-01-20-dataviz-makeover-1/",
    "title": "Dataviz Makeover 1",
    "description": "Re-imagining MOM's Labour Force in Singapore 2019 Report in Tableau",
    "author": [
      {
        "name": "Atticus Foo",
        "url": "https://public.tableau.com/profile/atticusfoo#!/"
      }
    ],
    "date": "2021-01-20",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nOverview\r\n#1 Asessment of visualisation based on clarity and aesthetics\r\n1.1 Clarity\r\n1.1.1 Annotations do not match the data presented in the table\r\n1.1.2 Which dataset is the graphic visualisation to?\r\n1.1.3 Unclear on the main point of the graphic:\r\n\r\n1.2 Aesthetics\r\n1.2.1 Labelling of Figure titles and captions\r\n1.2.2 Not ideal for readers with Colour-Vision Deficiencies (CVD)\r\n1.2.3 Directing focus with highlights\r\n\r\n\r\n#2 Sketch of Alternate Design\r\n#3 Proposed Visualisation in Tableau\r\n#4 Step-by-step guide\r\nData Preparation\r\nCharting Visualisation\r\n\r\n#5 Insights from the visualisation\r\n5.1 Aging Labour Force in Singapore\r\n5.2 Government Policy has an impact on LFPR\r\n5.3 Dramatic shifts in gender demographic between 2009 and 2019\r\n\r\n\r\nOverview\r\nThe Labour Force in Singapore 2019 is an annual report on Singapore’s labour market produced by the Manpower Research and Statistics Department. As part of the assignment, we will attempt to ‘makeover’ a chart depicting the resident labour force by age. The following sections of this makeover attempt can be found below:\r\n#1 Assessment of visualisation based on clarity and aesthetics\r\n#2 Sketch of alternate design\r\n#3 Proposed visualisation in Tableau\r\n#4 Step-by-step guide\r\n#5 Insights from the visualisation\r\n#1 Asessment of visualisation based on clarity and aesthetics\r\n“With population ageing and sustained rise in LFPR of older residents, the share of residents aged 55 & over in the labour force rose substantially from 16% in 2009 to 25% in 2019. Meanwhile, the share of resident labour force aged 25 to 54 declined from 75% to 67% even as their LFPR increased, as the population cohorts moving into these age bands were smaller than those who moved out due to lower birth rates. As a result the median age of residents in the labour force rose from 41 years in 2009 to 44 years in 2019.”\r\nWithout the context of the primary communication intent of the above chart, it is difficult to provide an assessment of how it can be improved. As such,the critique below will be based solely on the rubrics of clarity and aesthetics.\r\n1.1 Clarity\r\n1.1.1 Annotations do not match the data presented in the table\r\n• The selected age bands grouped in the annotations are not shown in the visual data - it is hence difficult to match the description with the visual. (e.g. 16% in 2009 = 8+4.6+1.8+1.2 = 15.6) and (25% in 2019 = 2019 10.2+7.3+4.5+2.7=24.7). • The current data or visualisation does not show the LFPR increase for the resident labour force aged 25 to 54 described in the annotation.\r\n1.1.2 Which dataset is the graphic visualisation to?\r\n• The annotations describe Labour Force Participation rate - however the data in the visualisation demonstrates data relating to resident labour force. This makes it difficult to follow the description\r\n• As the data only shows proportion of the labour force, it is not possible to determine the total volume of the labor force - to see if it has grown or shrunk from 2009 to 2019.\r\n1.1.3 Unclear on the main point of the graphic:\r\n• If the main aim is to demonstrate a) aging labor force, and b) increase in LBFR for 55 and over, the curre nt chart does not show the movement across the decade. • May be able to do bracketing to show the movement within the age groups.\r\n1.2 Aesthetics\r\n1.2.1 Labelling of Figure titles and captions\r\n• The chart adopts a 538 style of visual style, with the Figure Title and subtitle nested in the top left corner of the visualisation. While it is a trendy style to imitate, it is not executed well here as it the caption ‘per cent’ describes neither the title nor the graphic. • Instead, the subtitle ‘per cent’ could be moved closer to the table, so as to more clearly indicate that the data in the table are percentages. • The caption could then be changed to indicate that the graphic is intended to present the key point in the annotation - which is the shift in labour force demographic from 2009 to 2019. • The median of the graphic uses a continuous representation whereas the x axis is based on a categorical variable. This conflation is technically inaccurate and may make it confusing for the reader.\r\n1.2.2 Not ideal for readers with Colour-Vision Deficiencies (CVD)\r\n• In terms of aesthetics, the colour choice of grey and blue may be difficult to distinguish, especially for those with colour-vision deficiency (deuteranomaly). • It would be more helpful to refer to CVD safe colour scales so as to reach out to a wider group of readers. CVD simulators can be found online.\r\n1.2.3 Directing focus with highlights\r\n• There are two vertical reference lines to show the change in the median age from 41 years old to 44 years old. A visual cue could have been added to show the shift. This can be done in the form of a small arrow. • It also does not show the largest changes in each cohort (ie. 15-19 remained the same). • At the same time, within each cohort, changes could be made to show whether the cohort witnessed an increase or decrease.\r\n#2 Sketch of Alternate Design\r\nSource: Sketch of alternate designThe sketch above highlights the three key proposals for change from the original visualisation: • The first is to improve the layout of titles and labels on the axis. The intent to provide clear text labels while keeping the visualisation clutter-free by reducing duplication or irrelevant information. • Secondly, as the main objective is to demonstrate the key shifts from 2009 2019, a decision was made to select LFPR only. • Lastly, we intend to include a time series – since the data is provide by MOM – in order to identify if the shifts in LFPR can be attributed to key events during that decade.\r\n#3 Proposed Visualisation in Tableau\r\n\r\n\r\n\r\nFigure 1: Data Re-presented.\r\n\r\n\r\n\r\nThe visualisation was built using Tableau Desktop Professional Edition 2020.40.\r\nThe key change made in the data visualisation is to include key events and its possible impact on LFPR. This means utilising a time series instead of just comparing two points of data, 2019 and 2009. Based timeline, it is likely policy changes have directly led to changes in LFPR.\r\nIn addition, a feature that was integrated into the LFPR dataset was the gender demographic as we wanted to examine if policy shifts had an impact on male and female workers in the population.\r\nLastly, visual changes were made to ensure consistency and clarity when comparing LBFR. A greyscale was also adopted for the demographic age groups, in order to suggest Singapore’s aging labour force.\r\n#4 Step-by-step guide\r\nThe following steps will provide a brief overview of how the visualisation was completed.\r\nData Preparation\r\nThe data used for the visualisations were taken from the Ministry of Manpower’s website - Resident Labour Force Participation Rate by Age and Sex 2009 - 2019 June.\r\nSteps\r\nData Preparation\r\nData in excel was imported via Tableau\r\n\r\nData was examined using Tableau’s data viewer. As only certain age groups was needed, these were selected and filtered out for export.\r\n\r\nData was then exported to Excel and manually adjusted. This is because we intended to use gender as an additional category. As such, data in the other sheets were merged together to form a combined worksheet.\r\n\r\nLastly, the adjusted Excel document was imported again in Tableau. The data fields was cleaned to ensure that the values were accurately represented\r\n\r\nCharting Visualisation\r\nNext, with the data prepared, Tableau’s Polaris was used to visualise the worksheet\r\nSteps\r\nCharting Visualisation\r\nAfter adding age group and year to columns and LFPR and it’s duplicate to rows, you should get a graph that looks like this\r\n\r\nRight click on the graph and select dual axis to combine both charts. Now syncrhonise and edit the axis\r\n\r\nAn important step is to ensure that the axis were fixed - as there are null values inserted to create a separate category (total & gender)\r\n\r\nAdd gender to the color filter to adjust the graph’s colour palette\r\n\r\nAdd annotations to highlight key events in the timeline\r\n\r\nWe added a reference line in order to add visual cues to the change in female worker (55 - 64)\r\n\r\nFinally, edit the caption below the X axis to credit source\r\n\r\n#5 Insights from the visualisation\r\n\r\n\r\n\r\nFigure 2: Data Re-presented.\r\n\r\n\r\n\r\n5.1 Aging Labour Force in Singapore\r\n• There is an observe shift in Singapore’s LBFR, with more elderly workers from the ages of 55 and above remaining active in the population’s labour force. • This shift is most observable in the age groups of 55 – 64 with an increase in 9.3 percentage points from 2009 and 65 and over with an increase in 11.5 percentage points in the same period. • This is likely to increase in the next decade, especially with proposed changes to retirement age (raise from 62 to 65 by 2030) and re-employment age (raise from 67 to 70 by 2030)\r\n5.2 Government Policy has an impact on LFPR\r\n• Government policy introduced in the last decade has allowed Singapore’s aging population provide more protections to older workers. • This is necessary to protect our aging workforce, by legislating that companies extend their retirement and re-employment age, to ensure that older workers in Singapore can continue to work and support themselves in old age. • As there was intense debate in 2013 regarding Singapore’s Population White Paper, it would be interesting to integrate foreign worker data to understand better how Government measures have protected Singaporean workers – whilst ensuring a viable labour force in Singapore.\r\n5.3 Dramatic shifts in gender demographic between 2009 and 2019\r\n• Based on the visualisation, the most dramatic changes from 2009 to 2019 is the increase in female workers in the LBFR across three different age groups from 25 years upwards. • This could be attributed to the trend of dual income families from the turn of the century. More recently, these changes could be attributed to changes to improve protections to female workers following the CEDAW report in 2011. Changes to protect working mothers was also introduced together with the Employment Act amendments in 2013. • Of note, is the largest increase in the older female demographic (as high as 15.6 percentage pts), likely due to protections made for older workers guaranteeing their employment past the ages of 62.\r\nThank you for reading up to this point!\r\nThis blog is a data visualisation assignment for the MITB programme at the Singapore Management University.\r\nend\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-20-dataviz-makeover-1/images/week1/final2.png",
    "last_modified": "2021-01-28T13:12:08+08:00",
    "input_file": "dataviz-makeover-1.utf8.md"
  }
]
